<?php

/*
إستبدل علامة الإستفهام بواحد من ال Arithmetic Operators
يجب عدم تغيير الأرقام ولا إضافة اي أرقام
يجب أن تكون النتيجة النهائية صفر



###########################################################
######################   Assignment 2 #####################
###########################################################

// Needed Ouput
10
"integer"
10
"integer"
10
"integer"
*/

###########################################################
######################   Assignment 3 #####################
###########################################################

// echo !10 %  20 % 15 % 3 % 190 % 10 % 400; //0


###########################################################
######################   Assignment 4 #####################
###########################################################

// echo "                ";
// $a = "10";
// echo "                ";
// echo +$a;
// echo "                ";
// echo gettype(+$a);
// echo "                ";
// echo (int)$a;
// echo "                ";
// echo gettype((int)$a);
// echo "                ";
// echo 0 + $a;
// echo "                ";
// echo gettype(0 + $a);

// //* setType and intVal
// echo "                ";
// echo settype($a, "int");
// echo "                ";
// echo gettype($a);
// echo "                ";
// echo intval($a);
// echo "                ";
// echo gettype(intval($a));

// $a = 10;
// $b = 20; // -1
// echo "                ";
// echo (10 <=> 20); //-1


###########################################################
######################   Assignment 5 #####################
###########################################################
// $a = 10;
// $b = 20;
// $c = 15;

// var_dump($a < $b); // True
// // echo "                ";
// var_dump($c > $a); // True
// // echo "                ";
// var_dump($a <= $b); // True
// // echo "                ";
// var_dump($a != $b); // True
// // echo "                ";
// var_dump($a == $c); // True
// // echo "                ";
// var_dump($a <> $c); // True
// // echo "                ";
// var_dump(gettype($a) == gettype($b)); // True
// // echo "                ";
// var_dump(gettype($a) === gettype($b)); // True

// var_dump(gettype((float) $a) !== gettype($b)); // True

// $points = 10;

// while ($points < 13) {
//     $points++;
// }

// echo $points; // 13
// echo "                ";


// while ($points > 8) {
//     $points--;
// }
// echo "                ";
// echo $points; // 8;

###########################################################
######################   Assignment 6 #####################
###########################################################

// $a = "Elzero";
// $b = "Web";
// $c = "School";

// $d = $a . " " . $b . " " . $c;
// echo $d;
// echo "                ";
// $d = "$a   $b   $c";
// echo $d;
// echo "                ";
// $d = <<<HERE
// $a  $b  $c
// HERE;
// echo $d;
// echo "                ";
// $d = "{$a}  {$b}  {$c}";
// echo $d;
// echo "                ";
// $a = 10;
// $b = 20;

###########################################################
######################   Assignment 7 #####################
###########################################################
// $a = 10;
// $b = 20;

// echo $a + $b * $a + $b + $a * $a * $a; // 10000
// echo "                ";
// echo "                ";
// echo "                ";

// $a = @$b or die("There is error");

// $f = @file("Not_A_File") or die("no file found");

@(include("Not_A_File")) or die("test");
